app/controllers/api_controller.rb

def create_events
     url = "https://www.trumba.com/calendars/smithsonian-events.xml"
     @doc = Nokogiri::HTML(open(url))

     @doc.xpath("//entry").each_with_index do |node,i|
       if i < 10
         @event = Event.new

         @event.title = node.xpath("title").text
         @event.timings = node.xpath("formatteddatetime").text
         @event.categories = node.xpath("categories").text
         @event.eventlocation = node.xpath("eventlocation").text
         @event.cost = node.xpath("cost").text
         @event.sponser = node.xpath("sponsor").text
         @event.venue = node.xpath("venue").text
         @event.details = node.xpath("notes").text

         @event.save
---
INSERT INTO "events" ("categories", "cost", "created_at", "details", "eventlocation", "sponser", "timings", "title", "updated_at", "venue") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)